
<!DOCTYPE HTML>
<html lang="ko" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>3.2. Blockchain · TGrid</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Jeongho Nam">
        
        
    
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-back-to-top-button/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-codegroup/code.group.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-collapse/collapse.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-hide-navigation-buttons/index.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-language-picker/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-panel/icons.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-panel/panel.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-prism/prism.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-theme-github/style.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

    

        
    
    
    <meta  name="og:url"  content="https://tgrid.dev" >
    
    <meta  name="og:type"  content="website" >
    
    <meta  name="og:title"  content="TGrid Guide Documents" >
    
    <meta  name="og:description"  content="TypeScript Grid Computing Framework" >
    
    <meta  name="og:image"  content="https://tgrid.dev/assets/images/flag.png" >
    
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="swot.html" />
    


    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="검색어 입력" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        <li class="header">1. Introduction</li>
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    1.1. README
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.1.1" data-path="../">
            
                <a href="../#1-outline">
            
                    
                    1.1.1. Outline
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.2" data-path="../">
            
                <a href="../#2-strengths">
            
                    
                    1.1.2. Strengths
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.1.3" data-path="../">
            
                <a href="../#3-opportunities">
            
                    
                    1.1.3. Opportunities
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="header">2. Tutorial</li>
        
        
    
        <li class="chapter " data-level="2.1" data-path="../tutorial/concepts.html">
            
                <a href="../tutorial/concepts.html">
            
                    
                    2.1. Basic Concepts
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.1.1" data-path="../tutorial/concepts.html">
            
                <a href="../tutorial/concepts.html#1-theory">
            
                    
                    2.1.1. Theory
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.2" data-path="../tutorial/concepts.html">
            
                <a href="../tutorial/concepts.html#2-components">
            
                    
                    2.1.2. Components
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.1.3" data-path="../tutorial/concepts.html">
            
                <a href="../tutorial/concepts.html#3-protocols">
            
                    
                    2.1.3. Protocols
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.2" data-path="../tutorial/examples.html">
            
                <a href="../tutorial/examples.html">
            
                    
                    2.2. Learn from Examples
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.2.1" data-path="../tutorial/examples.html">
            
                <a href="../tutorial/examples.html#1-remote-function-call">
            
                    
                    2.2.1. Remote Function Call
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.2" data-path="../tutorial/examples.html">
            
                <a href="../tutorial/examples.html#2-remote-object-call">
            
                    
                    2.2.2. Remote Object Call
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.3" data-path="../tutorial/examples.html">
            
                <a href="../tutorial/examples.html#3-object-oriented-network">
            
                    
                    2.2.3. Object Oriented Network
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.2.4" data-path="../tutorial/examples.html">
            
                <a href="../tutorial/examples.html#4-remote-critical-section">
            
                    
                    2.2.4. Remote Critical Section
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="2.3" data-path="../tutorial/projects/">
            
                <a href="../tutorial/projects/">
            
                    
                    2.3. Learn from Projects
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="2.3.1" data-path="../tutorial/projects/chat.html">
            
                <a href="../tutorial/projects/chat.html">
            
                    
                    2.3.1. Chat Application
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3.2" data-path="../tutorial/projects/othello.html">
            
                <a href="../tutorial/projects/othello.html">
            
                    
                    2.3.2. Othello Game
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="2.3.3" data-path="../tutorial/projects/market.html">
            
                <a href="../tutorial/projects/market.html">
            
                    
                    2.3.3. Grid Market
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    
        
        <li class="header">3. Appendix</li>
        
        
    
        <li class="chapter " data-level="3.1" data-path="swot.html">
            
                <a href="swot.html">
            
                    
                    3.1. SWOT Analysis
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="3.2" data-path="blockchain.html">
            
                <a href="blockchain.html">
            
                    
                    3.2. Blockchain
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            GitBook에 게시
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >3.2. Blockchain</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
  <section class="normal markdown-body">
  
  <!-- @templates([
    ["Grid Computing", "[Grid Computing](../tutorial/concepts.md#11-grid-computing)"],
    ["Remote Function Call", "[Remote Function Call](../tutorial/concepts.md#12-remote-function-call)"]
]) -->
<h1 id="blockchain">Blockchain</h1>
<h2 id="1-outline">1. Outline</h2>
<p><strong>TGrid</strong> &#xC640; <a href="../tutorial/concepts.html#12-remote-function-call">Remote Function Call</a> &#xC744; &#xC774;&#xC6A9;&#xD558;&#xBA74;, &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC744; &#xBCF4;&#xB2E4; &#xC27D;&#xAC8C; &#xAC1C;&#xBC1C;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xC758; &#xAC1C;&#xBC1C; &#xB09C;&#xC774;&#xB3C4;&#xAC00; &#xB192;&#xB2E4;&#xB294; &#xAC83;&#xC740; &#xB9E4;&#xC6B0; &#xC720;&#xBA85;&#xD55C; &#xC774;&#xC57C;&#xAE30;&#xC785;&#xB2C8;&#xB2E4;. &#xAD6C;&#xD0DC;&#xC5EC; &#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC758; &#xBAB8;&#xAC12;&#xC774; &#xB2E4;&#xB77D;&#xAC19;&#xC774; &#xB192;&#xC544;&#xC11C; &#xADF8;&#xB7F0; &#xAC83;&#xB9CC;&#xC774; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xC21C; &#xAE30;&#xC220;&#xC801;&#xC778; &#xAD00;&#xC810;&#xC5D0;&#xC11C; &#xBCF4;&#xB354;&#xB77C;&#xB3C4;, &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC740; &#xADF8; &#xC790;&#xCCB4;&#xB85C; &#xB09C;&#xC774;&#xB3C4;&#xAC00; &#xB9E4;&#xC6B0; &#xB192;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB2E8;, &#xAE30;&#xC220;&#xC801;&#xC73C;&#xB85C; &#xBB34;&#xC5C7;&#xC774; &#xADF8;&#xB807;&#xAC8C; &#xC5B4;&#xB835;&#xB0D0;&#xACE0; &#xBB3C;&#xC5C8;&#xC744; &#xB54C;, &#xC800;&#xB294; &#xC774;&#xB807;&#xAC8C; &#xB9D0;&#xD558;&#xACE0; &#xC2F6;&#xC2B5;&#xB2C8;&#xB2E4;. </p>
<p>&#xC9C4;&#xC815; &#xC5B4;&#xB824;&#xC6B4; &#xAC83;&#xC740; <a href="#2-network-system">Network System</a> &#xB54C;&#xBB38;&#xC774;&#xC9C0;, <a href="#3-business-logic">Business Logic</a> &#xB54C;&#xBB38;&#xC740; &#xC544;&#xB2C8;&#xB77C;&#xACE0; &#xB9D0;&#xC785;&#xB2C8;&#xB2E4;.</p>
<h2 id="2-network-system">2. Network System</h2>
<p>&#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC744; &#xAC1C;&#xBC1C;&#xD558;&#xBA74;&#xC11C; &#xC9C4;&#xC815; &#xC5B4;&#xB824;&#xC6B4; &#xAC83;&#xC740;, &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD1B5;&#xC2E0;&#xC744; &#xC774;&#xC6A9;&#xD55C; &#xBD84;&#xC0B0;&#xCC98;&#xB9AC; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xAD6C;&#xD604;&#xD558;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC774; &#xC0AC;&#xC6A9;&#xD558;&#xB294; <em>Network System</em> &#xC740;, &#xAE30;&#xBCF8;&#xC801;&#xC73C;&#xB85C; &#xC218; &#xB9CC; ~ &#xC218;&#xC2ED; &#xB9CC; &#xB300;&#xC758; &#xCEF4;&#xD4E8;&#xD130;&#xAC00; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD1B5;&#xC2E0;&#xC73C;&#xB85C; &#xC5B4;&#xC6B0;&#xB7EC;&#xC838; &#xC5F0;&#xB3D9;&#xB418;&#xB294;, &#xCD08;&#xB300;&#xD615; &#xBD84;&#xC0B0;&#xCC98;&#xB9AC; &#xC2DC;&#xC2A4;&#xD15C;&#xC785;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC774;&#xB7F0; &#xC885;&#xB958;&#xC758; &#xCD08;&#xB300;&#xD615; &#xBD84;&#xC0B0;&#xCC98;&#xB9AC; &#xC2DC;&#xC2A4;&#xD15C;&#xB4E4;&#xC740; &#xD558;&#xB098;&#xAC19;&#xC774;, &#xC5B4;&#xB9C8;&#xBB34;&#xC2DC;&#xD55C; &#xB09C;&#xC774;&#xB3C4;&#xB97C; &#xC790;&#xB791;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC774;&#xB7F0; &#xC885;&#xB958;&#xC758; &#xCD08;&#xB300;&#xD615; &#xBD84;&#xC0B0;&#xCC98;&#xB9AC; &#xC2DC;&#xC2A4;&#xD15C;&#xB4E4;&#xC740; &#xD558;&#xB098;&#xAC19;&#xC774;, &#xC5B4;&#xB9C8;&#xBB34;&#xC2DC;&#xD55C; &#xB09C;&#xC774;&#xB3C4;&#xB97C; &#xC790;&#xB791;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB97C; &#xAC1C;&#xBC1C;&#xD558;&#xB294; &#xBAA8;&#xB4E0; &#xACFC;&#xC815;&#xC5D0; &apos;&#xC644;&#xBCBD;&apos; &#xC774;&#xB77C;&#xB294; &#xBB34;&#xC2DC;&#xBB34;&#xC2DC;&#xD55C; &#xC218;&#xC2DD;&#xC5B4;&#xAC00; &#xB530;&#xB77C;&#xB2E4;&#xB2D9;&#xB2C8;&#xB2E4;. </p>
<p>&#xC644;&#xBCBD;&#xD55C; &#xC694;&#xAD6C;&#xC0AC;&#xD56D; &#xBD84;&#xC11D;, &#xC644;&#xBCBD;&#xD55C; &#xC720;&#xC988;&#xCF00;&#xC774;&#xC2A4; &#xB3C4;&#xCD9C;, &#xC644;&#xBCBD;&#xD55C; &#xAC1C;&#xB150; &#xC124;&#xACC4;&#xC640; &#xB370;&#xC774;&#xD130; &#xAD6C;&#xC870; &#xC815;&#xB9BD;, &#xC644;&#xBCBD;&#xD55C; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC544;&#xD0A4;&#xD14D;&#xCC98; &#xC218;&#xB9BD;, &#xC644;&#xBCBD;&#xD55C; &#xAD6C;&#xD604;&#xACFC; &#xBAA8;&#xB4E0; &#xCF00;&#xC774;&#xC2A4;&#xB97C; &#xC544;&#xC6B0;&#xB974;&#xB294; &#xC644;&#xBCBD;&#xD55C; &#xD14C;&#xC2A4;&#xD2B8; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xC81C;&#xC791; &#xB4F1;...</p>
<p><a id="steps-to-hell"></a></p>
<p><div class="panel panel-info"><div class="panel-heading"><div class="panel-icon"><i class="icon-info"></i></div><div class="panel-title">&#xC9C0;&#xC625;&#xC73C;&#xB85C;&#xC758; &#xBC1C;&#xAC78;&#xC74C;</div></div><div class="panel-content"><h4 id="1-requirements">1 Requirements</h4>
<p>&#xC885;&#xB798;&#xC758; &#xBC29;&#xBC95;&#xC73C;&#xB85C; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC744; &#xAC1C;&#xBC1C;&#xD558;&#xB824;&#xAC70;&#xB4E0;, &#xC544;&#xC8FC; &#xB6F0;&#xC5B4;&#xB09C; &#xC544;&#xD0A4;&#xD14D;&#xD2B8;&#xBD80;&#xD130; &#xAD6C;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xC774; &#xC544;&#xD0A4;&#xD14D;&#xD2B8;&#xB294; &#xC81C;&#xC77C; &#xBA3C;&#xC800;, &#xC0C8;&#xB85C; &#xB9CC;&#xB4E4;&#xACE0;&#xC790; &#xD558;&#xB294; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC5D0; &#xB300;&#xD55C; &#xBAA8;&#xB4E0; &#xC694;&#xAD6C;&#xC0AC;&#xD56D;&#xC744; &#xC644;&#xBCBD;&#xD788; &#xC218;&#xC9D1;&#xD558;&#xC5EC; &#xC774;&#xB97C; &#xBB38;&#xC11C;&#xB85C;&#xC368; &#xC815;&#xB9AC;&#xD558;&#xC5EC;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC77C; &#xC0C8; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC5D0; &#xB300;&#xD55C; &#xC694;&#xAD6C;&#xC0AC;&#xD56D; &#xC911; &#xC81C;&#xB300;&#xB85C; &#xC778;&#xC9C0;&#xD558;&#xC9C0; &#xBABB;&#xD55C; &#xAC8C; &#xC788;&#xB2E4;&#xAC70;&#xB098;, &#xB098;&#xC911;&#xC5D0; &#xC694;&#xAD6C;&#xC0AC;&#xD56D;&#xC774; &#xBCC0;&#xD558;&#xB294; &#xC77C;&#xC774; &#xC0DD;&#xAE30;&#xBA74; &#xBAA8;&#xB4E0; &#xACFC;&#xC815;&#xC744; &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xB2E4;&#xC2DC; &#xC2DC;&#xC791;&#xD574;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C; &#xC694;&#xAD6C;&#xC0AC;&#xD56D; &#xBD84;&#xC11D;&#xC740; &#xB9E4;&#xC6B0; &#xAF3C;&#xAF3C;&#xD558;&#xAC8C; &#xC138;&#xBC00;&#xD558;&#xAC8C; &#xC774;&#xB8E8;&#xC5B4;&#xC838;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<h4 id="2-analyses">2 Analyses</h4>
<p>&#xC218;&#xC9D1;&#xD55C; &#xC694;&#xAD6C;&#xC0AC;&#xD56D;&#xC744; &#xCCA0;&#xC800;&#xD558;&#xAC8C; &#xBD84;&#xC11D;&#xD55C; &#xD6C4;, &#xBAA8;&#xB4E0; &#xC720;&#xC988;&#xCF00;&#xC774;&#xC2A4;&#xB97C; &#xC644;&#xBCBD;&#xD558;&#xAC8C; &#xBC1C;&#xAD74;&#xD574;&#xB0B4;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xD655;&#xC815;&#xD55C; &#xC720;&#xC988;&#xCF00;&#xC774;&#xC2A4;&#xC5D0; &#xB9DE;&#xCD94;&#xC5B4;, &#xAC1C;&#xB150; &#xC124;&#xACC4;&#xB3C4;&#xB97C; &#xC0C8;&#xB85C;&#xC774; &#xC791;&#xC131;&#xD569;&#xB2C8;&#xB2E4;. &#xB9CC;&#xC57D; &#xC774;&#xC804;&#xC5D0; &#xD589;&#xD558;&#xC600;&#xB358; &#xC694;&#xAD6C;&#xC0AC;&#xD56D; &#xBD84;&#xC11D;&#xC5D0; &#xBBF8;&#xC9C4;&#xD568;&#xC774; &#xC788;&#xAC70;&#xB098; &#xBAA8;&#xC21C;&#xC810;&#xC774; &#xC788;&#xAC70;&#xB4E0;, &#xB2E4;&#xC2DC; <a href="#1-requirements">1 Requirements</a> &#xB85C; &#xB3CC;&#xC544;&#xAC00; &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xB2E4;&#xC2DC; &#xC2DC;&#xC791;&#xD574;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<h4 id="3-designs">3 Designs</h4>
<p>&#xAC1C;&#xB150; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xC644;&#xBCBD;&#xD558;&#xAC8C; &#xC124;&#xACC4;&#xD588;&#xB2E4;&#xBA74;, &#xC774;&#xC5B4;&#xC11C; &#xB2E4;&#xC74C; &#xC124;&#xACC4;&#xB3C4;&#xB4E4;&#xC744; &#xADF8;&#xB824;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>Data Architecture</li>
<li>Network Architecture</li>
<li>Software Architecture</li>
</ul>
<p>&#xCCAB; &#xBC88;&#xC9F8;&#xB85C; &#xADF8;&#xB824;&#xC57C; &#xD560; &#xAC83;&#xC740; &#xB370;&#xC774;&#xD130; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB85C;&#xC368;, &#xC0C8; &#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xAC00; &#xC0AC;&#xC6A9;&#xD560; &#xB370;&#xC774;&#xD130; &#xBAA8;&#xB378;&#xC5D0; &#xB300;&#xD55C; &#xC124;&#xACC4;&#xB97C; &#xD574;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;. &#xC774;&#xB294; &#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xC911;&#xC5D0; &apos;&#xBE14;&#xB85D;&apos; &#xC5D0; &#xD574;&#xB2F9;&#xD55C;&#xB2E4;&#xACE0; &#xBCFC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xBB3C;&#xB860;, &#xB370;&#xC774;&#xD130; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xC798;&#xBABB; &#xC124;&#xACC4;&#xD558;&#xC600;&#xAC70;&#xB4E0;, &#xC774;&#xD6C4; &#xC5B4;&#xB5A4; &#xACFC;&#xC815;&#xC744; &#xC9C4;&#xD589; &#xC911;&#xC774;&#xB358;, &#xBB34;&#xC870;&#xAC74; &#xD604; &#xACFC;&#xC815;&#xAE4C;&#xC9C0; &#xD6C4;&#xD1F4;&#xD574;&#xC57C; &#xD558;&#xBBC0;&#xB85C; &#xBC18;&#xB4DC;&#xC2DC; &#xC644;&#xBCBD;&#xD558;&#xAC8C; &#xC124;&#xACC4;&#xD558;&#xB3C4;&#xB85D; &#xD55C;&#xB2E4;.</p>
<p>&#xB450; &#xBC88;&#xC9F8;&#xB85C; &#xADF8;&#xB824;&#xC57C; &#xD560; &#xAC83;&#xC740; &#xBC14;&#xB85C; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB85C;&#xC368;, &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xBD84;&#xC0B0;&#xCC98;&#xB9AC;&#xC5D0; &#xB300;&#xD55C; &#xC124;&#xACC4;&#xAC00; &#xC5EC;&#xAE30;&#xC5D0;&#xC11C; &#xC774;&#xB8E8;&#xC5B4;&#xC9D1;&#xB2C8;&#xB2E4;. &#xBA3C;&#xC800; &#xBD84;&#xC0B0;&#xCC98;&#xB9AC; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xBAA8;&#xB4E0; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0; &#xAC01;&#xAC01;&#xC758; &#xC5ED;&#xD560;&#xC744; &#xBD80;&#xC5EC;&#xD569;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xAC01; &#xCEF4;&#xD4E8;&#xD130;&#xAC04;&#xC5D0; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xB294; &#xBAA8;&#xB4E0; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xD1B5;&#xC2E0;&#xC5D0; &#xB300;&#xD558;&#xC5EC; &#xC815;&#xC758;&#xB97C; &#xD574;&#xC57C; &#xD558;&#xAE30; &#xB54C;&#xBB38;&#xC5D0;, &#xBAA8;&#xB4E0; &#xAC1C;&#xBC1C; &#xACFC;&#xC815;&#xC744; &#xD1B5;&#xD2C0;&#xC5B4; &#xC774; &#xACFC;&#xC815;&#xC774; &#xC81C;&#xC77C; &#xC5B4;&#xB835;&#xC2B5;&#xB2C8;&#xB2E4;. &#xB3D9;&#xC2DC;&#xC5D0; &#xAC00;&#xC7A5; &#xC644;&#xBCBD;&#xC744; &#xAE30;&#xD574;&#xC57C; &#xD558;&#xB294; &#xC124;&#xACC4; &#xACFC;&#xC815;&#xC774;&#xAE30;&#xB3C4; &#xD569;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC1A1;/&#xC218;&#xC2E0;&#xC774; &#xC774;&#xB8E8;&#xC5B4;&#xC9C0;&#xB294; &#xBAA8;&#xB4E0; &#xC21C;&#xAC04;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xC758;</li>
<li>&#xC1A1;/&#xC218;&#xC2E0;&#xB418;&#xB294; &#xAC01; &#xBA54;&#xC2DC;&#xC9C0;&#xC5D0; &#xB300;&#xD55C; &#xC815;&#xC758; (&#xBC14;&#xC774;&#xB108;&#xB9AC; &#xAD6C;&#xC870;&#xCCB4;)</li>
<li>&#xC1A1;/&#xC218;&#xC2E0;&#xB418;&#xB294; &#xAC01; &#xBA54;&#xC2DC;&#xC9C0;&#xAC00; &#xD568;&#xCD95;&#xD558;&#xB294; &#xC758;&#xBBF8; (&#xC2E4;&#xD589;&#xD574;&#xC57C; &#xD558;&#xB294; &#xBA85;&#xB839;&#xC5B4; &#xB4F1;)</li>
</ul>
<p>&#xB9C8;&#xC9C0;&#xB9C9; &#xC138; &#xBC88;&#xC9F8;&#xB85C; &#xADF8;&#xB824;&#xC57C; &#xD560; &#xAC83;&#xC740; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xBD84;&#xC0B0;&#xCC98;&#xB9AC; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xAC1C;&#xBCC4; &#xCEF4;&#xD4E8;&#xD130;, &#xADF8; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0;&#xC11C; &#xAC00;&#xB3D9;&#xB420; &#xAC1C;&#xBCC4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xB4E4;&#xC5D0; &#xB300;&#xD55C; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xC785;&#xB2C8;&#xB2E4;. &#xB370;&#xC774;&#xD130; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xC640; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xB530;&#xB77C; &#xD574;&#xB2F9; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC774; &#xAD6C;&#xD604;&#xD574;&#xC57C; &#xD560; &#xBC14;&#xB97C; &#xB2E4;&#xC774;&#xC5B4;&#xADF8;&#xB7A8;&#xC73C;&#xB85C; &#xD45C;&#xD604;&#xD558;&#xAC8C; &#xB429;&#xB2C8;&#xB2E4;. </p>
<h4 id="4-implementations">4 Implementations</h4>
<p>&#xC704; &#xACFC;&#xC815;&#xC5D0;&#xC11C; &#xB3C4;&#xCD9C;&#xB41C; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xB97C; &#xB530;&#xB77C; &#xBD84;&#xC0B0;&#xCC98;&#xB9AC; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xAC01; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0; &#xD0D1;&#xC7AC;&#xB420; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xAC1C;&#xBC1C;&#xD558;&#xB294; &#xACFC;&#xC815;&#xC785;&#xB2C8;&#xB2E4;. &#xBB3C;&#xB860; &#xAC1C;&#xBCC4; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC744; &#xAC1C;&#xBC1C;&#xD558;&#xB294; &#xC911;&#xC5D0; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xC5D0; &#xBBF8;&#xC9C4;&#xD55C; &#xC810;&#xC744; &#xBC1C;&#xACAC;&#xD588;&#xAC70;&#xB098; &#xBAA8;&#xC21C;&#xC810;&#xC744; &#xCC3E;&#xC544;&#xB0C8;&#xB2E4;&#xBA74;, &#xC774;&#xC804; &#xACFC;&#xC815;&#xC73C;&#xB85C; &#xB2E4;&#xC2DC; &#xB3CC;&#xC544;&#xAC00;&#xC57C;&#xD569;&#xB2C8;&#xB2E4;.</p>
<p>&#xB9CC;&#xC57D;, &#xADF8; &#xC798;&#xBABB;&#xB418;&#xC5C8;&#xB2E4;&#xB294; &#xAC83;&#xC774; &#xC694;&#xAD6C;&#xC0AC;&#xD56D;&#xC774;&#xB098; &#xBE44;&#xC9C0;&#xB2C8;&#xC2A4; &#xBAA8;&#xB378;&#xC5D0; &#xAD00;&#xD55C; &#xAC83;&#xC774;&#xB77C;&#xBA74;... </p>
<h4 id="5-conservations">5 Conservations</h4>
<p>&#xC5EC;&#xC9C0;&#xAECF; &#xC774;&#xB8E8;&#xC5B4;&#xC9C4; &#xC124;&#xACC4;&#xC640; &#xAC1C;&#xBC1C;&#xC774; &#xC644;&#xBCBD;&#xD588;&#xB294;&#xAC00;&#xB97C; &#xAC80;&#xC99D;&#xD558;&#xB294; &#xB2E8;&#xACC4;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xBB3C;&#xB860;, &#xC5EC;&#xC9C0;&#xAECF; &#xC774;&#xB8E8;&#xC5B4;&#xC9C4; &#xAC1C;&#xBC1C; &#xACFC;&#xC815; &#xC911;&#xC5D0; &#xB204;&#xB77D;&#xC774;&#xB098; &#xBAA8;&#xC21C;&#xB41C; &#xC810;&#xC774; &#xC788;&#xB2E4;&#xBA74;, &#xADF8; &#xACFC;&#xC815;&#xAE4C;&#xC9C0; &#xC804;&#xC18D; &#xD6C4;&#xD1F4;&#xD558;&#xACE0; &#xCC98;&#xC74C;&#xBD80;&#xD130; &#xADF8; &#xACFC;&#xC815;&#xC744; &#xB2E4;&#xC2DC; &#xBC1F;&#xC544;&#xB098;&#xAC00;&#xC57C; &#xD569;&#xB2C8;&#xB2E4;. &#xAC00;&#xB839; &#xB370;&#xC774;&#xD130; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xAC00; &#xC798;&#xBABB;&#xB418;&#xC5C8;&#xB2E4;&#xBA74;, &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xC758; &#xB300;&#xB2E4;&#xC218;&#xB97C; &#xD30C;&#xAE30;&#xD558;&#xACE0; &#xB2E4;&#xC2DC; &#xADF8;&#xB824;&#xC57C; &#xD558;&#xACE0;, &#xC774;&#xC5D0; &#xB530;&#xB77C; &#xC18C;&#xD504;&#xD2B8;&#xC6E8;&#xC5B4; &#xC544;&#xD0A4;&#xD14D;&#xCC98;&#xC640; &#xD504;&#xB85C;&#xADF8;&#xB7A8; &#xCF54;&#xB4DC;&#xAC00; &#xBAA8;&#xC870;&#xB9AC; &#xC601;&#xD5A5;&#xC744; &#xBC1B;&#xB294; &#xC0AC;&#xD0DC;&#xAC00; &#xC0DD;&#xAE41;&#xB2C8;&#xB2E4;.</p>
<p>&#xBC18;&#xB300;&#xB85C; &#xAC80;&#xC99D; &#xACFC;&#xC815;&#xC744; &#xD1B5;&#xD574; &#xBAA8;&#xB4E0; &#xAC1C;&#xBC1C; &#xACFC;&#xC815;&#xC774; &#xC644;&#xBCBD;&#xD558;&#xAC8C; &#xC644;&#xB8CC;&#xB418;&#xC5C8;&#xC74C;&#xC744; &#xD655;&#xC778;&#xD55C;&#xB2E4;&#xBA74;, &#xADF8;&#xC81C;&#xC11C;&#xC57C; &#xD574;&#xB2F9; &#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xC2DC;&#xC2A4;&#xD15C;&#xC744; &#xAC00;&#xB3D9;&#xD560; &#xC218; &#xC788;&#xAC8C; &#xB418;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
</div></div></p>
<p>&#xC774;&#xCC98;&#xB7FC; &#xC2E4;&#xC81C; &#xB3D9;&#xC791;&#xD558;&#xB294; &#xBE14;&#xB85D;&#xCCB4;&#xC778; (&#xCD08;&#xB300;&#xD615; &#xB124;&#xD2B8;&#xC6CC;&#xD06C; &#xBD84;&#xC0B0;&#xCC98;&#xB9AC;&#xC2DC;&#xC2A4;&#xD15C;) &#xC744; &#xAC1C;&#xBC1C;&#xD558;&#xB294; &#xAC83;&#xC740; &#xB9E4;&#xC6B0; &#xC5B4;&#xB824;&#xC6B4; &#xC77C;&#xC785;&#xB2C8;&#xB2E4;. &#xAD1C;&#xD788; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC744; &#xAC1C;&#xBC1C;&#xD558;&#xB824;&#xAC70;&#xB4E0;, &#xAE30;&#xB77C;&#xC131;&#xAC19;&#xC740; &#xC544;&#xD0A4;&#xD14D;&#xD2B8;&#xC640; &#xCC9C;&#xC7AC;&#xC758; &#xBC18;&#xC5F4;&#xC5D0; &#xB4E0; &#xC6B0;&#xC218;&#xD55C; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC774; &#xD544;&#xC694;&#xD558;&#xB2E4;&#xB294; &#xAC8C; &#xC544;&#xB2D9;&#xB2C8;&#xB2E4;. &#xD558;&#xC9C0;&#xB9CC; &#xADF8; &#xAE30;&#xB77C;&#xC131;&#xAC19;&#xC740; &#xC544;&#xD0A4;&#xD14D;&#xD2B8;&#xC640; &#xCC9C;&#xC7AC; &#xAC1C;&#xBC1C;&#xC790;&#xB4E4;&#xC870;&#xCC28;, &#xC26C;&#xC774; &#xC131;&#xACF5;&#xC744; &#xC7A5;&#xB2F4;&#xD560; &#xC218;&#xB294; &#xC5C6;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB4E4; &#xB610;&#xD55C; &#xBBF8;&#xC9C4;&#xD55C; &#xC694;&#xAD6C;&#xC0AC;&#xD56D; &#xBD84;&#xC11D;&#xC774;&#xB098; &#xC5B4;&#xC124;&#xD508; &#xC544;&#xD0A4;&#xD14D;&#xCC98; &#xC124;&#xACC4;&#xB85C; &#xC778;&#xD558;&#xC5EC; &#xD30C;&#xBA78;&#xC5D0; &#xB2AA;&#xC5D0; &#xBE60;&#xC9C8;&#xC9C0; &#xBAA8;&#xB974;&#xAC70;&#xB4E0;&#xC694;. </p>
<p>&#xC5B4;&#xCA4C;&#xBA74; &#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xAC1C;&#xBC1C;&#xD55C;&#xB2E4;&#xACE0; &#xC678;&#xCE58;&#xACE0; &#xB2E4;&#xB2C8;&#xB358; &#xADF8; &#xB9CE;&#xB358; &#xC0AC;&#xB78C;&#xB4E4;&#xACFC; &#xC5C5;&#xCCB4;&#xB4E4;&#xC774;, &#xC774;&#xD6C4;&#xC758; &#xC18C;&#xC2DD;&#xC744; &#xB4E4;&#xC744; &#xC218; &#xC5C6;&#xAC8C; &#xB41C; &#xB370;&#xC5D0;&#xB294;, &#xC774;&#xB7EC;&#xD55C; &#xC0AC;&#xC5F0;&#xC774; &#xC228;&#xC5B4;&#xC788;&#xC744;&#xC9C0;&#xB3C4; &#xBAA8;&#xB985;&#xB2C8;&#xB2E4;.</p>
<h2 id="3-business-logic">3. Business Logic</h2>
<p>&#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC758; <em>Business Logic</em> &#xC740; &#xADF8;&#xB2E4;&#xC9C0; &#xC5B4;&#xB835;&#xC9C0; &#xC54A;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<p>&#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC758; &#xD575;&#xC2EC; &#xC694;&#xC18C;&#xB97C; &#xB9D0;&#xD558;&#xB77C; &#xADF8;&#xB7EC;&#xBA74;, &#xADF8; &#xC774;&#xB984; &#xADF8;&#xB300;&#xB85C; &quot;&#xCCAB;&#xC9F8;&#xB294; Block &#xC774;&#xC694;, Chain &#xC785;&#xB2C8;&#xB2E4;&quot; &#xB77C;&#xACE0; &#xB300;&#xB2F5;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xC774; &#xC911; Block &#xC740; &#xC5B4;&#xB5A4; &#xB370;&#xC774;&#xD130;&#xB97C; &#xB2E4;&#xB8E8;&#xB0D0;&#xC5D0; &#xAD00;&#xD55C; &#xAC83;&#xC774;&#xACE0;, Chain &#xC740; &#xBE14;&#xB85D;&#xC5D0; &#xB370;&#xC774;&#xD130;&#xB97C; &#xAE30;&#xB85D;&#xD568;&#xC5D0; &#xC788;&#xC5B4; &apos;&#xC0C1;&#xD638;&#xAC04; &#xC5B4;&#xB5BB;&#xAC8C; &#xD569;&#xC758;&#xD560;&#xAE4C;&apos; &#xAC19;&#xC740; &#xC815;&#xCC45;&#xC5D0; &#xAD00;&#xD55C; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<table>
<thead>
<tr>
<th>Component</th>
<th>Conception</th>
<th>Description</th>
</tr>
</thead>
<tbody>
<tr>
<td> Block</td>
<td>Data Structure</td>
<td>&#xB370;&#xC774;&#xD130;&#xB97C; &#xC800;&#xC7A5;&#xD558;&#xB294; &#xBC29;&#xBC95;</td>
</tr>
<tr>
<td> Chain</td>
<td>Requirements</td>
<td>&#xD569;&#xC758; &#xB3C4;&#xCD9C;&#xC5D0; &#xAD00;&#xD55C; &#xC815;&#xCC45;</td>
</tr>
</tbody>
</table>
<p>&#xB9CC;&#xC77C; &#xC774; Block &#xACFC; Chain &#xC744; &#xB2E8; &#xD55C;&#xB300;&#xC758; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xB294; &#xB2E8;&#xC77C; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xC73C;&#xB85C; &#xAC1C;&#xBC1C;&#xD55C;&#xB2E4;&#xACE0; &#xC0DD;&#xAC01;&#xD574;&#xBD05;&#xC2DC;&#xB2E4;. &#xC774; &#xACBD;&#xC6B0;&#xC5D0;&#xB294; &#xADF8;&#xC800; &#xC790;&#xB8CC;&#xAD6C;&#xC870;&#xB97C; &#xC124;&#xACC4;&#xD558;&#xC5EC; &#xC774;&#xB97C; &#xB514;&#xC2A4;&#xD06C;&#xC5D0; &#xC800;&#xC7A5;&#xD560; &#xC218; &#xC788;&#xACE0;, &#xC815;&#xCC45; (&#xC694;&#xAD6C;&#xC0AC;&#xD56D;) &#xC744; &#xBD84;&#xC11D;&#xD558;&#xC5EC; &#xCF54;&#xB4DC;&#xB85C; &#xAD6C;&#xD604;&#xD560; &#xC218;&#xB9CC; &#xC788;&#xC73C;&#xBA74; &#xB429;&#xB2C8;&#xB2E4;. &#xC18C;&#xC591;&#xC788;&#xB294; &#xAC1C;&#xBC1C;&#xC790;&#xB77C;&#xBA74; &#xB204;&#xAD6C;&#xB098; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xB294; &#xAC83;, &#xADF8;&#xAC83;&#xC774; &#xBC14;&#xB85C; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC758; <em>Business Logic</em> &#xC785;&#xB2C8;&#xB2E4;. &#xC5EC;&#xB7EC;&#xBD84;&#xB3C4; &#xC5BC;&#xB9C8;&#xB4E0;&#xC9C0; &#xD574;&#xB0B4;&#xC2E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<h2 id="4-conclusion">4. Conclusion</h2>
<p>&#xC5EC;&#xD0DC;&#xAE4C;&#xC9C0;&#xC758; &#xC774;&#xC57C;&#xAE30;&#xB97C; &#xC815;&#xB9AC;&#xD558;&#xBA74;, &apos;&#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC740; <a href="#3-business-logic">Business Logic</a> &#xC740; &#xAC04;&#xB2E8;&#xD558;&#xC9C0;&#xB9CC;, &#xADF8;&#xAC83;&#xC758; <a href="#2-network-system">Network System</a> &#xC744; &#xAD6C;&#xC131;&#xD558;&#xB294; &#xAC83;&#xC740; &#xB9E4;&#xC6B0; &#xC5B4;&#xB835;&#xB2E4;&apos; &#xB77C;&#xACE0; &#xC694;&#xC57D;&#xD560; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC5EC;&#xAE30;&#xC11C;, &#xC6B0;&#xB9AC;&#xB294; &#xD55C; &#xAC00;&#xC9C0; &#xB300;&#xBAA9;&#xC5D0; &#xC8FC;&#xBAA9;&#xD560; &#xD544;&#xC694;&#xAC00; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xAC83;&#xC740; &#xBC14;&#xB85C; &apos;&#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC758; <a href="#3-business-logic">Business Logic</a> &#xC740; &#xAC04;&#xB2E8;&#xD558;&#xB2E4;&apos; &#xB77C;&#xB294; &#xAC83;&#xC785;&#xB2C8;&#xB2E4;.</p>
<p>&#xAE30;&#xC5B5;&#xD558;&#xC2ED;&#xB2C8;&#xAE4C;? <strong>TGrid</strong> &#xC640; <a href="../tutorial/concepts.html#12-remote-function-call">Remote Function Call</a> &#xC744; &#xC774;&#xC6A9;&#xD558;&#xBA74;, &#xC5EC;&#xB7EC; &#xB300;&#xC758; &#xCEF4;&#xD4E8;&#xD130;&#xB97C; <a href="../tutorial/concepts.html#11-grid-computing">&#xD55C; &#xB300;&#xC758; &#xAC00;&#xC0C1; &#xCEF4;&#xD4E8;&#xD130;</a> &#xB85C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;. &#xADF8;&#xB9AC;&#xACE0; &#xC774;&#xB807;&#xAC8C; &#xB9CC;&#xB4E0; &#xAC00;&#xC0C1; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xB294; &#xCF54;&#xB4DC;&#xB294;, &#xC2E4;&#xC81C;&#xB85C; &#xB2E8; &#xD55C;&#xB300;&#xC758; &#xCEF4;&#xD4E8;&#xD130;&#xC5D0;&#xC11C; &#xB3D9;&#xC791;&#xD558;&#xB294; &#xD504;&#xB85C;&#xADF8;&#xB7A8;&#xACFC; &#xADF8; <a href="#3-business-logic">Business Logic</a> &#xCF54;&#xB4DC;&#xAC00; &#xB3D9;&#xC77C;&#xD569;&#xB2C8;&#xB2E4;. &#xB530;&#xB77C;&#xC11C;, &#xC6B0;&#xB9AC;&#xB294; &#xB2E4;&#xC74C;&#xACFC; &#xAC19;&#xC740; &#xACB0;&#xB860;&#xC744; &#xB3C4;&#xCD9C;&#xD574;&#xB0BC; &#xC218; &#xC788;&#xC2B5;&#xB2C8;&#xB2E4;.</p>
<ul>
<li>&#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC758; <a href="#3-business-logic">Business Logic</a> &#xC740; &#xC5B4;&#xB835;&#xC9C0; &#xC54A;&#xB2E4;.</li>
<li><strong>TGrid</strong> &#xB97C; &#xC0AC;&#xC6A9;&#xD558;&#xBA74;, <a href="#3-business-logic">Business Logic</a> &#xC5D0;&#xB9CC; &#xC9D1;&#xC911;&#xD560; &#xC218; &#xC788;&#xB2E4;.</li>
<li>&#xB530;&#xB77C;&#xC11C; <strong>TGrid</strong> &#xC640; &#xD568;&#xAED8;&#xB77C;&#xBA74;, &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC744; &#xC27D;&#xAC8C; &#xB9CC;&#xB4E4; &#xC218; &#xC788;&#xB2E4;.</li>
</ul>
<p>&#xBE14;&#xB85D;&#xCCB4;&#xC778; &#xD504;&#xB85C;&#xC81D;&#xD2B8;&#xB97C; &#xD558;&#xB098; &#xC0C8;&#xB85C;&#xC774; &#xB9CC;&#xB4DC;&#xC2E0;&#xB2E4;&#xAD6C;&#xC694;? <strong>TGrid</strong> &#xC640; <a href="../tutorial/concepts.html#12-remote-function-call">Remote Function Call</a> &#xC744; &#xC0AC;&#xC6A9;&#xD558;&#xC2DC;&#xC5B4; <a href="../tutorial/concepts.html#11-grid-computing">Grid Computing</a> &#xC744; &#xC2E4;&#xD604;&#xD558;&#xC2ED;&#xC2DC;&#xC624;. &#xADF8;&#xB9AC;&#xACE0; &#xC5EC;&#xB7EC;&#xBD84;&#xAED8;&#xC11C; &#xB9CC;&#xB4E4;&#xACE0;&#xC790; &#xD558;&#xC2DC;&#xB294; &#xBE14;&#xB85D;&#xCCB4;&#xC778;&#xC758; &#xBCF8;&#xC9C8;, <a href="#3-business-logic">Business Logic</a>, &#xADF8; &#xC790;&#xCCB4;&#xC5D0;&#xB9CC; &#xC9D1;&#xC911;&#xD558;&#xC2ED;&#xC2DC;&#xC624;.</p>

  
  </section>

    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="swot.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 3.1. SWOT Analysis">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"3.2. Blockchain","level":"3.2","depth":1,"previous":{"title":"3.1. SWOT Analysis","level":"3.1","depth":1,"path":"appendix/swot.md","ref":"appendix/swot.md","articles":[]},"dir":"ltr"},"config":{"plugins":["-highlight","addcssjs","back-to-top-button","codegroup","collapse","disqus","github","hide-navigation-buttons","hide-published-with","import","language-picker","meta","panel","prism","scroll-to-top","theme-darkblue","theme-github","sitemap-general"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"prism":{},"disqus":{"useIdentifier":false,"shortName":"tgrid"},"language-picker":{"grid-columns":3},"scroll-to-top":{},"github":{"url":"https://github.com/samchon/tgrid"},"panel":{},"meta":{"content":"","data":[{"name":"og:url","content":"https://tgrid.dev"},{"name":"og:type","content":"website"},{"name":"og:title","content":"TGrid Guide Documents"},{"name":"og:description","content":"TypeScript Grid Computing Framework"},{"name":"og:image","content":"https://tgrid.dev/assets/images/flag.png"}],"name":""},"import":{},"theme-github":{},"search":{},"addcssjs":{"css":[],"js":[]},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"collapse":{},"hide-published-with":{},"sitemap-general":{"prefix":"https://tgrid.dev/"},"codegroup":{"defaultTabName":"Code","rememberTabs":true,"tabNameSeperator":"::"},"fontsettings":{"theme":"white","family":"sans","size":2},"hide-navigation-buttons":{},"theme-darkblue":{},"back-to-top-button":{},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Jeongho Nam","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"TGrid","language":"ko","gitbook":"*","description":"Guide Documents for TGrid"},"file":{"path":"appendix/blockchain.md","mtime":"2019-09-29T05:35:43.435Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-09-29T06:35:23.851Z"},"basePath":"..","book":{"language":"ko"}});
        });
    </script>
</div>

        
    
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-back-to-top-button/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-codegroup/code.group.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-collapse/collapse.js"></script>
        
    
        
        <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-disqus/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-hide-published-with/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-language-picker/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-scroll-to-top/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    

    </body>
</html>

